Catalogs/РассылкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РассылкиУведомлений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияМоментаУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияМоментаУведомления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияИнтервалаУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияИнтервалаУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкземплярТипаПредмета</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленийФиксированные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПолучательУведомлений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленийДинамические</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УведомленияСборСтатистики/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Уведомления";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	// АПК:1297-выкл Статистика, не локализуется
	Статистика.Вставить("Рассылки уведомлений", СтатистикаРассылокУведомлений());
	// АПК:1297-вкл
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Уведомления", СтатистикаУведомлений(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаРассылокУведомлений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РассылкиУведомлений.Ссылка) КАК Рассылок,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АктивныеРассылкиУведомлений.Ссылка) КАК АктивныхРассылок
		|ИЗ
		|	Справочник.РассылкиУведомлений КАК РассылкиУведомлений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РассылкиУведомлений КАК АктивныеРассылкиУведомлений
		|		ПО РассылкиУведомлений.Ссылка = АктивныеРассылкиУведомлений.Ссылка
		|			И (АктивныеРассылкиУведомлений.Подготовлена = ИСТИНА)
		|ГДЕ
		|	РассылкиУведомлений.ПометкаУдаления = ЛОЖЬ";
	
	ТаблицаРассылок = Запрос.Выполнить().Выгрузить();
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Рассылок", ТаблицаРассылок.ВыгрузитьКолонку("Рассылок")[0]);
	ПоказателиСтатистики.Вставить("Активных рассылок", ТаблицаРассылок.ВыгрузитьКолонку("АктивныхРассылок")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаУведомлений(НачалоПериода)
	
	Таблица = Метаданные.РегистрыСведений.Уведомления;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.Рассылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Рассылок";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Измерения.ДатаСобытия;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Ресурсы.Состояние;
	ДанныеГруппировки.ПредставлениеГруппировки = "Состояний";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.ВидТранспорта;
	ДанныеГруппировки.ПредставлениеГруппировки = "Видов транспорта";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти
